class നക്ഷത്രം:
    def __init__(ഇത്,നാമം,ഗണം,ഭാഗം=1):
        ഇത്.നാമം = നാമം
        ഇത്.ഗണം = ഗണം
        ഇത്.ഭാഗം = ഭാഗം

    def __str__(ഇത്):
        return ഇത്.നാമം

    def __repr__(ഇത്):
        return ഇത്.നാമം

class രാശി:
    def __init__(ഇത്,നാമം,അധിപൻ):
        ഇത്.നാമം = നാമം
        ഇത്.അധിപൻ = അധിപൻ
    
    def __str__(ഇത്):
        return ഇത്.നാമം

    def __repr__(ഇത്):
        return ഇത്.നാമം

class കാലം:
    def __init__(ഇത്):
        ഇത്.രാശ്യാധിപൻമാർ =('സൂര്യൻ','ചന്ദ്രൻ','കുജൻ','ബുധൻ','ഗുരു','ശുക്രൻ','ശനി')
        ഇത്.ഗണങ്ങൾ = ('ദേവഗണം','അസുരഗണം','മനുഷ്യഗണം')
        ഇത്.രാശികൾ = [രാശി(i[0],ഇത്.രാശ്യാധിപൻമാർ[i[1]]) for i in (('ചിങ്ങം',0),('കന്നി',3),('തുലാം',5),('വ്രിശ്ചികം',2),('ധനു',4),('മകരം',6),('കുംഭം',6),('മീനം',4),('മേടം',2),('ഇടവം',5),('മിഥുനം',3),('കർക്കിടകം',1))]
        ഇത്.നക്ഷത്രങ്ങൾ = [നക്ഷത്രം(i[0],ഇത്.ഗണങ്ങൾ[i[1]]) for i in (('അശ്വതി',0),('ഭരണി',2),('കാർത്തിക',1),('രോഹിണി',2),('മകയിരം',0),('തിരുവാതിര',2),('പുണർതം',0),('പൂയം',0),('ആയില്യം',1),
                                                  ('മകം',1),('പൂരം',2),('ഉത്രം',2),('അത്തം',0),('ചിത്തിര',1),('ചോതി',0),('വിശാഖം',1),('അനിഴം',0),('ത്രിക്കേട്ട',1),
                                                  ('മൂലം',1),('പൂരാടം',2),('ഉത്രാടം',2),('തിരുവോണം',0),('അവിട്ടം',1),('ചതയം',1),('പൂരുരുട്ടാതി',2),('ഉത്ത്രട്ടാതി',2),('രേവതി',0))]          
    @property
    def നക്ഷത്രം(ഇത്):
        for ന in ഇത്.നക്ഷത്രങ്ങൾ:
            yield ന
    @property
    def രാശി(ഇത്):
        for ര in ഇത്.രാശികൾ:
            yield ര
        

    
